Sloshing Tank/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         75;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2;
maxAlphaCo      2;

maxDeltaT       1;

functions
{
    residuals
    {
        type            residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;

        fields
        (
            p
            U
        );
    }

    forces
    {
        type forces;
        functionObjectLibs ("libforces.so");
        patches (cylinderWall);
        rhoNameField
        {
            rho nitrogen;
            rho nitrogenTetraoxide;
        }
        log true;
        CofR (0 0 0);
        writeControl    timeStep;
        writeInterval   1;
    }

 

    sloshingFrequency
    {
        type            timeStep;
        libs            ("libutilityFunctionObjects.so");

        writeControl    timeStep;
        writeInterval   1;

        functionObjectLibs ("libforces.so");
        enabled         true;

        outputControl   timeStep;
        outputInterval  1;

        patches         (cylinderWall);
        rho             nitrogen;
        rho             nitrogenTetraoxide;
        interfaceAngle  3;       // Interface angle between fluids (in degrees)
        diameter        1.2;     // Cylinder diameter (in meters)
        height          1.4;     // Cylinder height (in meters)
    }

}
// ************************************************************************* //
