Sloshing Tank/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    wall
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }

    side
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }

    inlet
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }


    outlet
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }


    defaultFaces
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
