Sloshing Tank/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.nitrogenTetraoxide 0
);

regions
(
    rotatedBoxToCell
    {
        box (-10 -10 -10) (10 10 0);
	centre (0 0 0);
	n1 (-1 0 0);
	n2 (-1 0 0.063);
        fieldValues
        (
            volScalarFieldValue alpha.nitrogenTetraoxide 1
        );
    }
);


// ************************************************************************* //
